clc;clear all;close all;
%PC2R
%输入指标
X=[14.40,16.90,15.53,15.40,14.17,13.33,12.83,13,13.40,14;...
    0.65,0.72,0.72,0.76,0.76,0.69,0.61,0.63,0.75,0.84;...
    31.3,32.2,31.87,32.23,32.4,30.77,29.23,28.2,28.8,29.1];
%输出指标
Y=[3621,3943,4086.67,4904.67,6311.67,8173.33,10263,12094.33,13603.33,14841;...
    0,0.09,0.07,0.13,0.37,0.59,0.51,0.44,0.58,1];
[m,n]=size(X);
s=size(Y,1);
A=[-X',Y'];
b=zeros(n,1);
LB=zeros(m+s,1);
UB=[];
for i=1:n
    f=[zeros(1,m),-Y(:,i)'];
    Aeq=[X(:,i)',zeros(1,s)];
    beq=1;
    w(:,i)=linprog(f,A,b,Aeq,beq,LB,UB);
    %解线性规划，得DMU的最佳权向量w
    E(i)=Y(:,i)'*w(m+1:m+s,i);%求DMUi的相对效率值Ei
end
%E %输入相对效率值Ei
Omega=w(1:m,:); %输出投入权向量
mu=w(m+1:m+s,:);%输出产出权向量